In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv(r"E:\Portfolio_Project\statistics\income.csv")
df

        Name   Income
0        Rob     5000
1      Rafiq     6000
2       Nona     4000
3      Sofia     7500
4      Mohan     8000
5        Tao     7000
6  Elon Mask  1000000

In [6]:
df.Income.describe()

count          7.000000
mean      148214.285714
std       375604.829702
min         4000.000000
25%         5500.000000
50%         7000.000000
75%         7750.000000
max      1000000.000000
Name: Income, dtype: float64

In [7]:
df.Income.quantile(0)

4000.0

In [8]:
df.Income.quantile(0.25,interpolation="higher")

6000

In [9]:
df.Income.quantile(0.5,interpolation="higher")

7000

In [10]:
df.Income.quantile(0.75)

7750.0

In [11]:
df.Income.quantile(1)

1000000.0

In [12]:
percentile_99 = df.Income.quantile(0.99)
percentile_99

940479.9999999995

In [13]:
df[df.Income>percentile_99]

        Name   Income
6  Elon Mask  1000000

In [14]:
df

        Name   Income
0        Rob     5000
1      Rafiq     6000
2       Nona     4000
3      Sofia     7500
4      Mohan     8000
5        Tao     7000
6  Elon Mask  1000000

In [15]:
df['Income'][3]=np.NaN

C:\Users\sonjo\AppData\Local\Temp\ipykernel_856\1244639895.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income'][3]=np.NaN

In [16]:
df

        Name     Income
0        Rob     5000.0
1      Rafiq     6000.0
2       Nona     4000.0
3      Sofia        NaN
4      Mohan     8000.0
5        Tao     7000.0
6  Elon Mask  1000000.0

In [17]:
df.Income.mean()

171666.66666666666

In [18]:
df_new = df.fillna(df.Income.mean())
df_new

        Name          Income
0        Rob     5000.000000
1      Rafiq     6000.000000
2       Nona     4000.000000
3      Sofia   171666.666667
4      Mohan     8000.000000
5        Tao     7000.000000
6  Elon Mask  1000000.000000

In [19]:
df_new = df.fillna(df.Income.median())
df_new

        Name     Income
0        Rob     5000.0
1      Rafiq     6000.0
2       Nona     4000.0
3      Sofia     6500.0
4      Mohan     8000.0
5        Tao     7000.0
6  Elon Mask  1000000.0